MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32PG26B301F1024IL136/mcu.h
/** Flash and SRAM limits for EFM32PG26B301F1024IL136 */
#define FLASH_BASE                               (0x08000000UL) /**< Flash Base Address */
#define FLASH_SIZE                               (0x00100000UL) /**< Available Flash Memory */
#define FLASH_PAGE_SIZE                          (0x00002000UL) /**< Flash Memory page size */
#define SRAM_BASE                                (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE                                (0x00040000UL) /**< Available SRAM Memory */
#define DMA_CHAN_COUNT                           LDMA_CH_NUM    /**< Number of DMA channels */
#define EXT_IRQ_COUNT                            93             /**< Number of External (NVIC) interrupts */

/* GPIO Avalibility Info */
#define GPIO_PA_INDEX                            0U         /**< Index of port PA */
#define GPIO_PA_COUNT                            16U        /**< Number of pins on port PA */
#define GPIO_PA_MASK                             (0xFFFFUL) /**< Port PA pin mask */
#define GPIO_PA_PIN0                             1U         /**< GPIO pin PA0 is present. */
#define GPIO_PA_PIN1                             1U         /**< GPIO pin PA1 is present. */
#define GPIO_PA_PIN2                             1U         /**< GPIO pin PA2 is present. */
#define GPIO_PA_PIN3                             1U         /**< GPIO pin PA3 is present. */
#define GPIO_PA_PIN4                             1U         /**< GPIO pin PA4 is present. */
#define GPIO_PA_PIN5                             1U         /**< GPIO pin PA5 is present. */
#define GPIO_PA_PIN6                             1U         /**< GPIO pin PA6 is present. */
#define GPIO_PA_PIN7                             1U         /**< GPIO pin PA7 is present. */
#define GPIO_PA_PIN8                             1U         /**< GPIO pin PA8 is present. */
#define GPIO_PA_PIN9                             1U         /**< GPIO pin PA9 is present. */
#define GPIO_PA_PIN10                            1U         /**< GPIO pin PA10 is present. */
#define GPIO_PA_PIN11                            1U         /**< GPIO pin PA11 is present. */
#define GPIO_PA_PIN12                            1U         /**< GPIO pin PA12 is present. */
#define GPIO_PA_PIN13                            1U         /**< GPIO pin PA13 is present. */
#define GPIO_PA_PIN14                            1U         /**< GPIO pin PA14 is present. */
#define GPIO_PA_PIN15                            1U         /**< GPIO pin PA15 is present. */
#define GPIO_PB_INDEX                            1U         /**< Index of port PB */
#define GPIO_PB_COUNT                            16U        /**< Number of pins on port PB */
#define GPIO_PB_MASK                             (0xFFFFUL) /**< Port PB pin mask */
#define GPIO_PB_PIN0                             1U         /**< GPIO pin PB0 is present. */
#define GPIO_PB_PIN1                             1U         /**< GPIO pin PB1 is present. */
#define GPIO_PB_PIN2                             1U         /**< GPIO pin PB2 is present. */
#define GPIO_PB_PIN3                             1U         /**< GPIO pin PB3 is present. */
#define GPIO_PB_PIN4                             1U         /**< GPIO pin PB4 is present. */
#define GPIO_PB_PIN5                             1U         /**< GPIO pin PB5 is present. */
#define GPIO_PB_PIN6                             1U         /**< GPIO pin PB6 is present. */
#define GPIO_PB_PIN7                             1U         /**< GPIO pin PB7 is present. */
#define GPIO_PB_PIN8                             1U         /**< GPIO pin PB8 is present. */
#define GPIO_PB_PIN9                             1U         /**< GPIO pin PB9 is present. */
#define GPIO_PB_PIN10                            1U         /**< GPIO pin PB10 is present. */
#define GPIO_PB_PIN11                            1U         /**< GPIO pin PB11 is present. */
#define GPIO_PB_PIN12                            1U         /**< GPIO pin PB12 is present. */
#define GPIO_PB_PIN13                            1U         /**< GPIO pin PB13 is present. */
#define GPIO_PB_PIN14                            1U         /**< GPIO pin PB14 is present. */
#define GPIO_PB_PIN15                            1U         /**< GPIO pin PB15 is present. */
#define GPIO_PC_INDEX                            2U         /**< Index of port PC */
#define GPIO_PC_COUNT                            16U        /**< Number of pins on port PC */
#define GPIO_PC_MASK                             (0xFFFFUL) /**< Port PC pin mask */
#define GPIO_PC_PIN0                             1U         /**< GPIO pin PC0 is present. */
#define GPIO_PC_PIN1                             1U         /**< GPIO pin PC1 is present. */
#define GPIO_PC_PIN2                             1U         /**< GPIO pin PC2 is present. */
#define GPIO_PC_PIN3                             1U         /**< GPIO pin PC3 is present. */
#define GPIO_PC_PIN4                             1U         /**< GPIO pin PC4 is present. */
#define GPIO_PC_PIN5                             1U         /**< GPIO pin PC5 is present. */
#define GPIO_PC_PIN6                             1U         /**< GPIO pin PC6 is present. */
#define GPIO_PC_PIN7                             1U         /**< GPIO pin PC7 is present. */
#define GPIO_PC_PIN8                             1U         /**< GPIO pin PC8 is present. */
#define GPIO_PC_PIN9                             1U         /**< GPIO pin PC9 is present. */
#define GPIO_PC_PIN10                            1U         /**< GPIO pin PC10 is present. */
#define GPIO_PC_PIN11                            1U         /**< GPIO pin PC11 is present. */
#define GPIO_PC_PIN12                            1U         /**< GPIO pin PC12 is present. */
#define GPIO_PC_PIN13                            1U         /**< GPIO pin PC13 is present. */
#define GPIO_PC_PIN14                            1U         /**< GPIO pin PC14 is present. */
#define GPIO_PC_PIN15                            1U         /**< GPIO pin PC15 is present. */
#define GPIO_PD_INDEX                            3U         /**< Index of port PD */
#define GPIO_PD_COUNT                            16U        /**< Number of pins on port PD */
#define GPIO_PD_MASK                             (0xFFFFUL) /**< Port PD pin mask */
#define GPIO_PD_PIN0                             1U         /**< GPIO pin PD0 is present. */
#define GPIO_PD_PIN1                             1U         /**< GPIO pin PD1 is present. */
#define GPIO_PD_PIN2                             1U         /**< GPIO pin PD2 is present. */
#define GPIO_PD_PIN3                             1U         /**< GPIO pin PD3 is present. */
#define GPIO_PD_PIN4                             1U         /**< GPIO pin PD4 is present. */
#define GPIO_PD_PIN5                             1U         /**< GPIO pin PD5 is present. */
#define GPIO_PD_PIN6                             1U         /**< GPIO pin PD6 is present. */
#define GPIO_PD_PIN7                             1U         /**< GPIO pin PD7 is present. */
#define GPIO_PD_PIN8                             1U         /**< GPIO pin PD8 is present. */
#define GPIO_PD_PIN9                             1U         /**< GPIO pin PD9 is present. */
#define GPIO_PD_PIN10                            1U         /**< GPIO pin PD10 is present. */
#define GPIO_PD_PIN11                            1U         /**< GPIO pin PD11 is present. */
#define GPIO_PD_PIN12                            1U         /**< GPIO pin PD12 is present. */
#define GPIO_PD_PIN13                            1U         /**< GPIO pin PD13 is present. */
#define GPIO_PD_PIN14                            1U         /**< GPIO pin PD14 is present. */
#define GPIO_PD_PIN15                            1U         /**< GPIO pin PD15 is present. */

/* Fixed Resource Locations */
#define GPIO_SWCLK_PORT                          GPIO_PA_INDEX /**< Port of SWCLK.*/
#define GPIO_SWCLK_PIN                           1U            /**< Pin of SWCLK.*/
#define GPIO_SWDIO_PORT                          GPIO_PA_INDEX /**< Port of SWDIO.*/
#define GPIO_SWDIO_PIN                           2U            /**< Pin of SWDIO.*/
#define GPIO_SWV_PORT                            GPIO_PA_INDEX /**< Port of SWV.*/
#define GPIO_SWV_PIN                             3U            /**< Pin of SWV.*/
#define GPIO_TDI_PORT                            GPIO_PA_INDEX /**< Port of TDI.*/
#define GPIO_TDI_PIN                             4U            /**< Pin of TDI.*/
#define GPIO_TDO_PORT                            GPIO_PA_INDEX /**< Port of TDO.*/
#define GPIO_TDO_PIN                             3U            /**< Pin of TDO.*/
#define GPIO_TRACECLK_PORT                       GPIO_PA_INDEX /**< Port of TRACECLK.*/
#define GPIO_TRACECLK_PIN                        4U            /**< Pin of TRACECLK.*/
#define GPIO_TRACEDATA0_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA0.*/
#define GPIO_TRACEDATA0_PIN                      3U            /**< Pin of TRACEDATA0.*/
#define GPIO_TRACEDATA1_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA1.*/
#define GPIO_TRACEDATA1_PIN                      5U            /**< Pin of TRACEDATA1.*/
#define GPIO_TRACEDATA2_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA2.*/
#define GPIO_TRACEDATA2_PIN                      6U            /**< Pin of TRACEDATA2.*/
#define GPIO_TRACEDATA3_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA3.*/
#define GPIO_TRACEDATA3_PIN                      7U            /**< Pin of TRACEDATA3.*/
#define GPIO_EFP_INT_PORT                        GPIO_PC_INDEX /**< Port of EFP_INT.*/
#define GPIO_EFP_INT_PIN                         5U            /**< Pin of EFP_INT.*/
#define GPIO_EFP_TX_SCL_PORT                     GPIO_PC_INDEX /**< Port of EFP_TX_SCL.*/
#define GPIO_EFP_TX_SCL_PIN                      2U            /**< Pin of EFP_TX_SCL.*/
#define GPIO_EFP_TX_SDA_PORT                     GPIO_PC_INDEX /**< Port of EFP_TX_SDA.*/
#define GPIO_EFP_TX_SDA_PIN                      1U            /**< Pin of EFP_TX_SDA.*/
#define GPIO_EM4WU0_PORT                         GPIO_PA_INDEX /**< Port of EM4WU0.*/
#define GPIO_EM4WU0_PIN                          5U            /**< Pin of EM4WU0.*/
#define GPIO_EM4WU10_PORT                        GPIO_PD_INDEX /**< Port of EM4WU10.*/
#define GPIO_EM4WU10_PIN                         5U            /**< Pin of EM4WU10.*/
#define GPIO_EM4WU3_PORT                         GPIO_PB_INDEX /**< Port of EM4WU3.*/
#define GPIO_EM4WU3_PIN                          1U            /**< Pin of EM4WU3.*/
#define GPIO_EM4WU4_PORT                         GPIO_PB_INDEX /**< Port of EM4WU4.*/
#define GPIO_EM4WU4_PIN                          3U            /**< Pin of EM4WU4.*/
#define GPIO_EM4WU6_PORT                         GPIO_PC_INDEX /**< Port of EM4WU6.*/
#define GPIO_EM4WU6_PIN                          0U            /**< Pin of EM4WU6.*/
#define GPIO_EM4WU7_PORT                         GPIO_PC_INDEX /**< Port of EM4WU7.*/
#define GPIO_EM4WU7_PIN                          5U            /**< Pin of EM4WU7.*/
#define GPIO_EM4WU8_PORT                         GPIO_PC_INDEX /**< Port of EM4WU8.*/
#define GPIO_EM4WU8_PIN                          7U            /**< Pin of EM4WU8.*/
#define GPIO_EM4WU9_PORT                         GPIO_PD_INDEX /**< Port of EM4WU9.*/
#define GPIO_EM4WU9_PIN                          2U            /**< Pin of EM4WU9.*/
#define GPIO_THMSW_EN_PORT                       GPIO_PC_INDEX /**< Port of THMSW_EN.*/
#define GPIO_THMSW_EN_PIN                        9U            /**< Pin of THMSW_EN.*/
#define GPIO_THMSW_HALFSWITCH_PORT               GPIO_PC_INDEX /**< Port of THMSW_HALFSWITCH.*/
#define GPIO_THMSW_HALFSWITCH_PIN                9U            /**< Pin of THMSW_HALFSWITCH.*/
#define LCD_COM0_PORT                            GPIO_PD_INDEX /**< Port of COM0.*/
#define LCD_COM0_PIN                             2U            /**< Pin of COM0.*/
#define LCD_COM1_PORT                            GPIO_PD_INDEX /**< Port of COM1.*/
#define LCD_COM1_PIN                             3U            /**< Pin of COM1.*/
#define LCD_COM2_PORT                            GPIO_PD_INDEX /**< Port of COM2.*/
#define LCD_COM2_PIN                             4U            /**< Pin of COM2.*/
#define LCD_COM3_PORT                            GPIO_PD_INDEX /**< Port of COM3.*/
#define LCD_COM3_PIN                             5U            /**< Pin of COM3.*/
#define LCD_COM4_PORT                            GPIO_PB_INDEX /**< Port of COM4.*/
#define LCD_COM4_PIN                             8U            /**< Pin of COM4.*/
#define LCD_COM5_PORT                            GPIO_PB_INDEX /**< Port of COM5.*/
#define LCD_COM5_PIN                             9U            /**< Pin of COM5.*/
#define LCD_COM6_PORT                            GPIO_PB_INDEX /**< Port of COM6.*/
#define LCD_COM6_PIN                             10U           /**< Pin of COM6.*/
#define LCD_COM7_PORT                            GPIO_PB_INDEX /**< Port of COM7.*/
#define LCD_COM7_PIN                             11U           /**< Pin of COM7.*/
#define LCD_LCD_CP_PORT                          GPIO_PA_INDEX /**< Port of LCD_CP.*/
#define LCD_LCD_CP_PIN                           6U            /**< Pin of LCD_CP.*/
#define LCD_SEG0_PORT                            GPIO_PC_INDEX /**< Port of SEG0.*/
#define LCD_SEG0_PIN                             0U            /**< Pin of SEG0.*/
#define LCD_SEG1_PORT                            GPIO_PC_INDEX /**< Port of SEG1.*/
#define LCD_SEG1_PIN                             1U            /**< Pin of SEG1.*/
#define LCD_SEG10_PORT                           GPIO_PA_INDEX /**< Port of SEG10.*/
#define LCD_SEG10_PIN                            4U            /**< Pin of SEG10.*/
#define LCD_SEG11_PORT                           GPIO_PA_INDEX /**< Port of SEG11.*/
#define LCD_SEG11_PIN                            5U            /**< Pin of SEG11.*/
#define LCD_SEG12_PORT                           GPIO_PA_INDEX /**< Port of SEG12.*/
#define LCD_SEG12_PIN                            7U            /**< Pin of SEG12.*/
#define LCD_SEG13_PORT                           GPIO_PA_INDEX /**< Port of SEG13.*/
#define LCD_SEG13_PIN                            8U            /**< Pin of SEG13.*/
#define LCD_SEG14_PORT                           GPIO_PB_INDEX /**< Port of SEG14.*/
#define LCD_SEG14_PIN                            0U            /**< Pin of SEG14.*/
#define LCD_SEG15_PORT                           GPIO_PB_INDEX /**< Port of SEG15.*/
#define LCD_SEG15_PIN                            1U            /**< Pin of SEG15.*/
#define LCD_SEG16_PORT                           GPIO_PB_INDEX /**< Port of SEG16.*/
#define LCD_SEG16_PIN                            2U            /**< Pin of SEG16.*/
#define LCD_SEG17_PORT                           GPIO_PB_INDEX /**< Port of SEG17.*/
#define LCD_SEG17_PIN                            3U            /**< Pin of SEG17.*/
#define LCD_SEG18_PORT                           GPIO_PC_INDEX /**< Port of SEG18.*/
#define LCD_SEG18_PIN                            8U            /**< Pin of SEG18.*/
#define LCD_SEG19_PORT                           GPIO_PC_INDEX /**< Port of SEG19.*/
#define LCD_SEG19_PIN                            9U            /**< Pin of SEG19.*/
#define LCD_SEG2_PORT                            GPIO_PC_INDEX /**< Port of SEG2.*/
#define LCD_SEG2_PIN                             2U            /**< Pin of SEG2.*/
#define LCD_SEG20_PORT                           GPIO_PA_INDEX /**< Port of SEG20.*/
#define LCD_SEG20_PIN                            9U            /**< Pin of SEG20.*/
#define LCD_SEG21_PORT                           GPIO_PA_INDEX /**< Port of SEG21.*/
#define LCD_SEG21_PIN                            10U           /**< Pin of SEG21.*/
#define LCD_SEG22_PORT                           GPIO_PA_INDEX /**< Port of SEG22.*/
#define LCD_SEG22_PIN                            11U           /**< Pin of SEG22.*/
#define LCD_SEG23_PORT                           GPIO_PA_INDEX /**< Port of SEG23.*/
#define LCD_SEG23_PIN                            12U           /**< Pin of SEG23.*/
#define LCD_SEG24_PORT                           GPIO_PA_INDEX /**< Port of SEG24.*/
#define LCD_SEG24_PIN                            13U           /**< Pin of SEG24.*/
#define LCD_SEG25_PORT                           GPIO_PA_INDEX /**< Port of SEG25.*/
#define LCD_SEG25_PIN                            14U           /**< Pin of SEG25.*/
#define LCD_SEG26_PORT                           GPIO_PB_INDEX /**< Port of SEG26.*/
#define LCD_SEG26_PIN                            4U            /**< Pin of SEG26.*/
#define LCD_SEG27_PORT                           GPIO_PB_INDEX /**< Port of SEG27.*/
#define LCD_SEG27_PIN                            5U            /**< Pin of SEG27.*/
#define LCD_SEG28_PORT                           GPIO_PD_INDEX /**< Port of SEG28.*/
#define LCD_SEG28_PIN                            6U            /**< Pin of SEG28.*/
#define LCD_SEG29_PORT                           GPIO_PD_INDEX /**< Port of SEG29.*/
#define LCD_SEG29_PIN                            7U            /**< Pin of SEG29.*/
#define LCD_SEG3_PORT                            GPIO_PC_INDEX /**< Port of SEG3.*/
#define LCD_SEG3_PIN                             3U            /**< Pin of SEG3.*/
#define LCD_SEG30_PORT                           GPIO_PD_INDEX /**< Port of SEG30.*/
#define LCD_SEG30_PIN                            8U            /**< Pin of SEG30.*/
#define LCD_SEG31_PORT                           GPIO_PD_INDEX /**< Port of SEG31.*/
#define LCD_SEG31_PIN                            9U            /**< Pin of SEG31.*/
#define LCD_SEG32_PORT                           GPIO_PD_INDEX /**< Port of SEG32.*/
#define LCD_SEG32_PIN                            10U           /**< Pin of SEG32.*/
#define LCD_SEG33_PORT                           GPIO_PD_INDEX /**< Port of SEG33.*/
#define LCD_SEG33_PIN                            11U           /**< Pin of SEG33.*/
#define LCD_SEG34_PORT                           GPIO_PB_INDEX /**< Port of SEG34.*/
#define LCD_SEG34_PIN                            6U            /**< Pin of SEG34.*/
#define LCD_SEG35_PORT                           GPIO_PB_INDEX /**< Port of SEG35.*/
#define LCD_SEG35_PIN                            7U            /**< Pin of SEG35.*/
#define LCD_SEG36_PORT                           GPIO_PB_INDEX /**< Port of SEG36.*/
#define LCD_SEG36_PIN                            8U            /**< Pin of SEG36.*/
#define LCD_SEG37_PORT                           GPIO_PB_INDEX /**< Port of SEG37.*/
#define LCD_SEG37_PIN                            9U            /**< Pin of SEG37.*/
#define LCD_SEG38_PORT                           GPIO_PB_INDEX /**< Port of SEG38.*/
#define LCD_SEG38_PIN                            10U           /**< Pin of SEG38.*/
#define LCD_SEG39_PORT                           GPIO_PB_INDEX /**< Port of SEG39.*/
#define LCD_SEG39_PIN                            11U           /**< Pin of SEG39.*/
#define LCD_SEG4_PORT                            GPIO_PC_INDEX /**< Port of SEG4.*/
#define LCD_SEG4_PIN                             4U            /**< Pin of SEG4.*/
#define LCD_SEG5_PORT                            GPIO_PC_INDEX /**< Port of SEG5.*/
#define LCD_SEG5_PIN                             5U            /**< Pin of SEG5.*/
#define LCD_SEG6_PORT                            GPIO_PC_INDEX /**< Port of SEG6.*/
#define LCD_SEG6_PIN                             6U            /**< Pin of SEG6.*/
#define LCD_SEG7_PORT                            GPIO_PC_INDEX /**< Port of SEG7.*/
#define LCD_SEG7_PIN                             7U            /**< Pin of SEG7.*/
#define LCD_SEG8_PORT                            GPIO_PA_INDEX /**< Port of SEG8.*/
#define LCD_SEG8_PIN                             0U            /**< Pin of SEG8.*/
#define LCD_SEG9_PORT                            GPIO_PA_INDEX /**< Port of SEG9.*/
#define LCD_SEG9_PIN                             1U            /**< Pin of SEG9.*/
#define LFXO_LFXTAL_I_PORT                       GPIO_PD_INDEX /**< Port of LFXTAL_I.*/
#define LFXO_LFXTAL_I_PIN                        1U            /**< Pin of LFXTAL_I.*/
#define LFXO_LFXTAL_O_PORT                       GPIO_PD_INDEX /**< Port of LFXTAL_O.*/
#define LFXO_LFXTAL_O_PIN                        0U            /**< Pin of LFXTAL_O.*/
#define LFXO_LF_EXTCLK_PORT                      GPIO_PD_INDEX /**< Port of LF_EXTCLK.*/
#define LFXO_LF_EXTCLK_PIN                       1U            /**< Pin of LF_EXTCLK.*/
#define VDAC0_CH0_MAIN_OUT_PORT                  GPIO_PB_INDEX /**< Port of CH0_MAIN_OUT.*/
#define VDAC0_CH0_MAIN_OUT_PIN                   0U            /**< Pin of CH0_MAIN_OUT.*/
#define VDAC0_CH1_MAIN_OUT_PORT                  GPIO_PB_INDEX /**< Port of CH1_MAIN_OUT.*/
#define VDAC0_CH1_MAIN_OUT_PIN                   1U            /**< Pin of CH1_MAIN_OUT.*/
#define VDAC1_CH0_MAIN_OUT_PORT                  GPIO_PB_INDEX /**< Port of CH0_MAIN_OUT.*/
#define VDAC1_CH0_MAIN_OUT_PIN                   2U            /**< Pin of CH0_MAIN_OUT.*/
#define VDAC1_CH1_MAIN_OUT_PORT                  GPIO_PB_INDEX /**< Port of CH1_MAIN_OUT.*/
#define VDAC1_CH1_MAIN_OUT_PIN                   3U            /**< Pin of CH1_MAIN_OUT.*/

